
## Plan Result (sandbox)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.api.azurerm_api_management_api.api
  * module.api.azurerm_api_management_product_api.link_to_product[0]
  * module.plum_product.azurerm_api_management_product.product
  * module.policy.azurerm_api_management_api_policy.api_policy
* Update
  * module.plum-redis-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-sandbox"
      + api_type              = "http"
      + display_name          = "crumble-recipes"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "crumble-recipes-api"
      + path                  = "crumble-recipes-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "core-infra-sandbox"
      + revision              = "1"
      + service_url           = "http://crumble-recipe-backend-sandbox.service.core-compute-sandbox.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/cnp-plum-recipes-service.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-sandbox"
      + api_name            = "crumble-recipes-api"
      + id                  = (known after apply)
      + product_id          = "plum-recipes"
      + resource_group_name = "core-infra-sandbox"
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox"
        name                          = "crumble-recipe-backend-session-storage-sandbox"
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "2024-10-08"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (15 unchanged attributes hidden)
        }
    }

  # module.plum_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-sandbox"
      + approval_required     = true
      + display_name          = "plum-recipes"
      + id                    = (known after apply)
      + product_id            = "plum-recipes"
      + published             = true
      + resource_group_name   = "core-infra-sandbox"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-sandbox"
      + api_name            = "crumble-recipes-api"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-sandbox"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null)" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Missing client certificate</set-body>
                            </return-response>
                        </when>
                        <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;4A98AB1CFFBA46CACBC7D8D3E10FDA667261DFAA&quot;,&quot;8B0666A1041156C83BCE832906F9BC7C2542B65A&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Invalid client certificate</set-body>
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1054,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->